### Terraform Plan for `dev` environment

#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.api will be created
  + resource "azuread_application" "api" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "TimeClock API - dev"
      + id                          = (known after apply)
      + identifier_uris             = [
          + "api://timeclock-api-dev",
        ]
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "234e7b3c-68bf-49c8-b69a-fa8e5f9d93a4",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = [
          + "environment:dev",
          + "managed-by:terraform",
        ]
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access the TimeClock API on behalf of the signed-in user"
              + admin_consent_display_name = "Access TimeClock API as user"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access the TimeClock API on your behalf"
              + user_consent_display_name  = "Access TimeClock API"
              + value                      = "access_as_user"
            }
        }

      + web {
          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # azuread_application.blazor will be created
  + resource "azuread_application" "blazor" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "TimeClock Blazor - dev"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "234e7b3c-68bf-49c8-b69a-fa8e5f9d93a4",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = [
          + "environment:dev",
          + "managed-by:terraform",
        ]
      + template_id                 = (known after apply)

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d"
              + type = "Scope"
            }
        }
      + required_resource_access {
          + resource_app_id = (known after apply)

          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
        }

      + single_page_application {
          + redirect_uris = (known after apply)
        }

      + web {
          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # azuread_service_principal.api will be created
  + resource "azuread_service_principal" "api" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "234e7b3c-68bf-49c8-b69a-fa8e5f9d93a4",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = [
          + "environment:dev",
          + "managed-by:terraform",
        ]
      + type                         = (known after apply)
    }

  # azuread_service_principal.blazor will be created
  + resource "azuread_service_principal" "blazor" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "234e7b3c-68bf-49c8-b69a-fa8e5f9d93a4",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = [
          + "environment:dev",
          + "managed-by:terraform",
        ]
      + type                         = (known after apply)
    }

  # azuread_service_principal_delegated_permission_grant.blazor_to_api will be created
  + resource "azuread_service_principal_delegated_permission_grant" "blazor_to_api" {
      + claim_values                         = [
          + "access_as_user",
        ]
      + id                                   = (known after apply)
      + resource_service_principal_object_id = (known after apply)
      + service_principal_object_id          = (known after apply)
    }

  # azurerm_container_group.backend will be created
  + resource "azurerm_container_group" "backend" {
      + dns_name_label              = (known after apply)
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "backend-api-dev"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "rg-timeclock-dev"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + tags                        = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }

      + container {
          + commands                     = (known after apply)
          + cpu                          = 0.5
          + environment_variables        = {
              + "ASPNETCORE_ENVIRONMENT"  = "dev"
              + "Authentication__Enabled" = "true"
            }
          + image                        = (known after apply)
          + memory                       = 1
          + name                         = "backend"
          + secure_environment_variables = (sensitive value)

          + ports {
              + port     = 80
              + protocol = "TCP"
            }
        }

      + image_registry_credential {
          + password = (sensitive value)
          + server   = (known after apply)
          + username = (known after apply)
        }
    }

  # azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-timeclock-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = [
          + {
              + object_id          = "234e7b3c-68bf-49c8-b69a-fa8e5f9d93a4"
              + secret_permissions = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                ]
              + tenant_id          = "bbe45b4e-b07a-4b69-ae5a-54880360f7d0"
            },
        ]
      + enable_rbac_authorization     = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "kv-timeclock-dev"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-timeclock-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }
      + tenant_id                     = "bbe45b4e-b07a-4b69-ae5a-54880360f7d0"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.azuread_api_client_id will be created
  + resource "azurerm_key_vault_secret" "azuread_api_client_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "azuread-api-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.azuread_api_identifier_uri will be created
  + resource "azurerm_key_vault_secret" "azuread_api_identifier_uri" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "azuread-api-identifier-uri"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.azuread_api_scope will be created
  + resource "azurerm_key_vault_secret" "azuread_api_scope" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "azuread-api-scope"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.azuread_blazor_client_id will be created
  + resource "azurerm_key_vault_secret" "azuread_blazor_client_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "azuread-blazor-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.azuread_tenant_id will be created
  + resource "azurerm_key_vault_secret" "azuread_tenant_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "azuread-tenant-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sql_connection_string will be created
  + resource "azurerm_key_vault_secret" "sql_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sql-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sql_password will be created
  + resource "azurerm_key_vault_secret" "sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 32
      + min_capacity                                               = (known after apply)
      + name                                                       = "timeclockdb"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false
    }

  # azurerm_mssql_firewall_rule.allow_azure_services will be created
  + resource "azurerm_mssql_firewall_rule" "allow_azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_firewall_rule.allow_my_ip will be created
  + resource "azurerm_mssql_firewall_rule" "allow_my_ip" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowMyIP"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                  = (sensitive value)
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "eastus"
      + minimum_tls_version                  = "1.2"
      + name                                 = (known after apply)
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "rg-timeclock-dev"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }
      + version                              = "12.0"
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-timeclock-dev"
      + tags     = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }
    }

  # azurerm_static_web_app.blazor will be created
  + resource "azurerm_static_web_app" "blazor" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "eastus2"
      + name                               = "swa-timeclock-dev"
      + preview_environments_enabled       = true
      + resource_group_name                = "rg-timeclock-dev"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "timeclock"
        }
    }

  # random_password.sql_admin_password will be created
  + resource "random_password" "sql_admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_string.unique_suffix will be created
  + resource "random_string" "unique_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_uuid.api_scope_id will be created
  + resource "random_uuid" "api_scope_id" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_admin_password            = (sensitive value)
  + acr_admin_username            = (sensitive value)
  + acr_login_server              = (known after apply)
  + azuread_api_application_id    = (known after apply)
  + azuread_api_identifier_uri    = "api://timeclock-api-dev"
  + azuread_api_scope             = "api://timeclock-api-dev/access_as_user"
  + azuread_blazor_application_id = (known after apply)
  + azuread_configuration_summary = (known after apply)
  + azuread_tenant_id             = "bbe45b4e-b07a-4b69-ae5a-54880360f7d0"
  + backend_fqdn                  = (known after apply)
  + backend_ip_address            = (known after apply)
  + backend_url                   = (known after apply)
  + key_vault_name                = "kv-timeclock-dev"
  + key_vault_uri                 = (known after apply)
  + resource_group_name           = "rg-timeclock-dev"
  + sql_connection_string         = "Retrieve from Key Vault: kv-timeclock-dev/secrets/sql-connection-string"
  + sql_database_name             = "timeclockdb"
  + sql_server_fqdn               = (known after apply)
  + static_web_app_api_key        = (sensitive value)
  + static_web_app_url            = (known after apply)

```

</details>

*Pusher: @VinceSeely, Action: `pull_request`, Workflow: `Terraform - PR Preview`*